benchmark_report/wrk_results_22967/wrk_1000concurrent.txt
Running 30s test @ http://localhost:18080
  12 threads and 1000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   208.75ms  353.53ms   1.99s    82.35%
    Req/Sec   589.00    200.57     1.59k    70.27%
  Latency Distribution
     50%   19.50ms
     75%  284.24ms
     90%  848.31ms
     99%    1.31s 
  210862 requests in 31.12s, 19.30MB read
  Socket errors: connect 0, read 0, write 0, timeout 4437
Requests/sec:   6776.57
Transfer/sec:    635.30KB