benchmark_report/wrk_results_22967/wrk_100concurrent.txt
Running 30s test @ http://localhost:18080
  12 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    25.78ms   93.12ms 983.92ms   97.49%
    Req/Sec   653.28     89.38     0.90k    74.02%
  Latency Distribution
     50%   11.96ms
     75%   13.50ms
     90%   15.49ms
     99%  636.76ms
  235394 requests in 31.06s, 21.55MB read
Requests/sec:   7578.63
Transfer/sec:    710.50KB