benchmark_report/wrk_results_22967/wrk_1200concurrent.txt
Running 30s test @ http://localhost:18080
  12 threads and 1200 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   192.56ms  345.78ms   1.94s    84.68%
    Req/Sec   576.84    204.08     1.54k    69.54%
  Latency Distribution
     50%   19.70ms
     75%   50.67ms
     90%  849.29ms
     99%    1.28s 
  207381 requests in 31.10s, 18.99MB read
  Socket errors: connect 0, read 0, write 0, timeout 5279
Requests/sec:   6667.75
Transfer/sec:    625.10KB