benchmark_report/wrk_results_22967/wrk_1500concurrent.txt
Running 30s test @ http://localhost:18080
  12 threads and 1500 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   160.38ms  327.40ms   1.99s    85.67%
    Req/Sec   592.96    195.00     1.48k    71.14%
  Latency Distribution
     50%   19.00ms
     75%   22.74ms
     90%  789.58ms
     99%    1.26s 
  212640 requests in 31.14s, 19.47MB read
  Socket errors: connect 0, read 0, write 0, timeout 5952
Requests/sec:   6828.88
Transfer/sec:    640.21KB