benchmark_report/wrk_results_22967/wrk_200concurrent.txt
Running 30s test @ http://localhost:18080
  12 threads and 200 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   126.43ms  253.83ms   1.47s    86.53%
    Req/Sec   611.63    157.67     1.10k    70.32%
  Latency Distribution
     50%   18.01ms
     75%   24.64ms
     90%  556.78ms
     99%    1.01s 
  219854 requests in 31.13s, 20.13MB read
  Socket errors: connect 0, read 0, write 0, timeout 157
Requests/sec:   7062.93
Transfer/sec:    662.15KB