benchmark_report/wrk_results_22967/wrk_400concurrent.txt
Running 30s test @ http://localhost:18080
  12 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   189.60ms  316.06ms   1.93s    83.14%
    Req/Sec   634.90    209.26     2.19k    69.16%
  Latency Distribution
     50%   18.40ms
     75%  222.16ms
     90%  761.67ms
     99%    1.14s 
  228217 requests in 31.17s, 20.89MB read
  Socket errors: connect 0, read 0, write 0, timeout 1093
Requests/sec:   7321.72
Transfer/sec:    686.41KB