benchmark_report/wrk_results_22967/wrk_600concurrent.txt
Running 30s test @ http://localhost:18080
  12 threads and 600 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   204.11ms  334.91ms   2.00s    82.90%
    Req/Sec   574.72    218.03     1.81k    70.84%
  Latency Distribution
     50%   20.36ms
     75%  257.14ms
     90%  780.98ms
     99%    1.25s 
  206573 requests in 31.01s, 18.91MB read
  Socket errors: connect 0, read 0, write 0, timeout 2173
Requests/sec:   6661.00
Transfer/sec:    624.47KB