benchmark_report/wrk_results_22967/wrk_800concurrent.txt
Running 30s test @ http://localhost:18080
  12 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   192.64ms  329.76ms   1.93s    84.04%
    Req/Sec   503.69    195.33     1.28k    69.07%
  Latency Distribution
     50%   23.00ms
     75%  208.99ms
     90%  768.94ms
     99%    1.25s 
  180473 requests in 31.16s, 16.52MB read
  Socket errors: connect 0, read 0, write 0, timeout 3280
Requests/sec:   5792.31
Transfer/sec:    543.03KB